{
	"scenes": [
		{
			"id": -1,
			"sound": true,
			"image": "start.png",
			"needed": [],
			"receiving": [-1, -2, -3],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Home",
					"given": []
				}
			],
			"dialogue": "Your Statistics:\nTime: {TIME}\nScenes Visited: {VISITED}\n"
		},

		{
			"id": 0,
			"sound": true,
			"image": "start.png",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 8,
					"text": "Start game. ",
					"given": []
				},
				{
					"id": 3,
					"text": "Tutorial, please. ",
					"given": []
				},
				{
					"id": 2,
					"text": "Information. ",
					"given": []
				},
				{
					"id": 1,
					"text": "Credits.  ",
					"given": []
				}
			],
			"dialogue": "Welcome! \nThis is the Clearwater Trial. \nHow may I help you?!"
		},

		{
			"id": 1,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Back to menu. ",
					"given": []
				}
			],
			"dialogue": "Thank you for showing interest in the people who worked on creating this little game. \n\nStory creation & writing. \nKatharina. \n\nLiterally everything else. \nMichael."
		},

		{
			"id": 2,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Back to menu. ",
					"given": []
				}
			],
			"dialogue": "About the game: \nThis is a text-based adventure game where you will face puzzles of varying types and difficulties. \nThey are set up in three groups of three, meaning a total of nine puzzles, where solving one in a group will unlock the next area, and should you fail the puzzle, you have two other puzzles to attempt instead. \nNone are too hard, though some may seem challenging. \nWhether they are a piece of cake or turn your brain to mush, we hope you enjoy them. \n\nAbout the creator: \nMichael is learning coding and has to make a text-based game in java for class. However, he doesn’t think of himself as a good story creator, and asks a friend for help. \nAs they share the same Discord group, they both agree that making a silly game, based on their silly corner of internet madness, and full of references that no one outside the Discord will get, is a good idea. And so, the work began. \n\nIf you’re reading this, the coding and story were finished and combined into a game, and we both hope you’ll enjoy the end result."
		},

		{
			"id": 3,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Yes, thank you, I’ll return to the menu. ",
					"given": []
				},
				{
					"id": 4,
					"text": "No, sorry, can you give an example? ",
					"given": []
				}
			],
			"dialogue": "Ah, new to text-based games, perhaps? \nAlright, here’s a rundown. \n\nThis text will be a bit of story, telling you what is going on, what you can do and what you see around you, and the buttons underneath will give you choices. \nSome may give or take items you can use or have used, some may give hidden items you aren’t told about, which may help or hinder later on, by locking or unlocking new dialogue. \n\nDid this help?"
		},

		{
			"id": 4,
			"sound": true,
			"image": "tutorial.png",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 5,
					"text": "Read note. ",
					"given": []
				},
				{
					"id": 6,
					"text": "Eat the cinnamon cookie. ",
					"given": []
				},
				{
					"id": 7,
					"text": "Eat the chocolate cookie. ",
					"given": []
				}
			],
			"dialogue": "Of course! \nText-based games aren’t for everyone, so here’s a small example situation. \nHopefully this will help you understand better. \n\nYou’re standing in front of a table. On the table are two plates and a note. \nThe two plates hold one cookie each; one is cinnamon, and the other is chocolate."
		},

		{
			"id": 5,
			"sound": true,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 6,
					"text": "Eat the cinnamon cookie. ",
					"given": []
				},
				{
					"id": 7,
					"text": "Eat the chocolate cookie. ",
					"given": []
				}
			],
			"dialogue": "The note reads: \n“The cinnamon cookie is poisoned.”"
		},

		{
			"id": 6,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": 0,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Back to menu. ",
					"given": []
				}
			],
			"dialogue": "If you read the note, you would know this cookie was poisoned. \nThis was just an example, however, so nothing happens. \nIn the actual game, you may have met a game over and had to restart. \n\nHope this helped. \nGood luck and enjoy the game!"
		},

		{
			"id": 7,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Back to menu. ",
					"given": []
				}
			],
			"dialogue": "If you read the note, you would know the other cookie was poisoned and this one was safe. \nThis was just an example, however, so nothing happens. \nIn the actual game, you may have met a game over and had to restart if you chose the other cookie. \n\nHope this helped. \nGood luck and enjoy the game!"
		},

		{
			"id": 8,
			"sound": true,
			"image": "1.png",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 10,
					"text": "Hand over the letter. ",
					"given": []
				},
				{
					"id": 9,
					"text": "Refuse. ",
					"given": []
				}
			],
			"dialogue": "You walk down the path, as told by the letter you received. \nWhen you heard of the Clearwater Trial, it never crossed your mind that you may have to go to a dark forest to do your trials. \n\nThe forest grows denser by the minute as you walk, and you soon realize the plants are different than the ones near the parking lot. \nThe forest is no longer a mere forest, it has become a dark, damp jungle. \n\nAs you step into a clearing, matching the description of the letter, with lit candles and lanterns strewn about everywhere, you feel more alone than ever. You’re sure this is where you were meant to meet the guide. \nYou turn, contemplating making your way back to the car and going home, but the path is gone. \n\n“Welcome to the Clearwater Trial.” You spin around at the sudden voice. “May I see your acceptance letter?”"
		},

		{
			"id": 9,
			"sound": true,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": -1,
					"text": "Return to menu.",
					"given": []
				}
			],
			"dialogue": "“I see.” He nods and gestures to the area behind you. “You may leave.” \nYou aren’t completely sure what’s going on, but as you turn, you see the path is there once more. \nYou turn back to ask the man what’s going on, but he’s gone and all the lights around the clearing have gone out. \n\nYou head back to the car, confused and disappointed. \nGuess today wasn’t your lucky day after all. \n\nMissed the chance. \nGame over."
		},

		{
			"id": 10,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 11,
					"text": "Continue.",
					"given": []
				}
			],
			"dialogue": "You hand over the letter, watching the man’s smile forming into an almost feral grin. \n“I see.” He looks at you and gives back the letter. “I am Michael. I will be your guide today. Welcome to the Clearwater Trial.” He turns and walks over to a large stone wall. “Are you certain you wish to attempt the trial? Not all who enter will survive.” \nYou nod. You have worked hard to get this far, and you do not want to lose your chance now."
		},

		{
			"id": 11,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 12,
					"text": "Look at the doors. ",
					"given": []
				}
			],
			"dialogue": "Michael nods, an expression of approval on his face. He touches the stone wall, and intricate markings begin to glow, outlining what you can only describe as doors carved directly into the rock. \nAs you watch, the doors open where no door was before, and the man beckons you to follow with a wave of his hand. \n\nAs you enter, you find yourself in a small rotunda. Michael stands in the middle, waiting for your attention to return to him. \n“The first round of trials. You will choose one, and should you succeed, you will move on to the next chamber, the next trials. Should you fail, you will return here. Should you fail all three, you will be sent home.” \nHe waits for a sign that you heard and understood what he said, before continuing. \n“In this first set of trials, only one is potentially fatal. I will not tell you which door that is.” \n\nHe gestures around the room to three doors. “I can give you a small hint as to each door’s trial, should you be uncertain.”"
		},

		{
			"id": 12,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 13,
					"text": "Ask about the white door. ",
					"given": []
				},
				{
					"id": 14,
					"text": "Ask about the stone door. ",
					"given": []
				},
				{
					"id": 15,
					"text": "Ask about the wooden door. ",
					"given": []
				}
			],
			"dialogue": "You look at the three doors. \nTo your left is a pristine, white door, akin to the kind you’d see leading to a kitchen. \nTo your right is a stone door, lavishly decorated with gold, silks and royal colors, with a large T as its centerpiece. \nIn the middle, revealed as Michael steps aside, you see a wooden door with dark blue accents, similar to what you’d see in a library."
		},

		{
			"id": 13,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 16,
					"text": "Choose the white door.  ",
					"given": []
				},
				{
					"id": 12,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "Michael looks at the pristine, white door. “Ah, miss Violet’s trial. A combination challenge. Quite easy and straight-forward, so long as you know how to listen.””"
		},

		{
			"id": 14,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 36,
					"text": "Choose the stone door. ",
					"given": []
				},
				{
					"id": 12,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "Michael chuckles as you ask about the stone door. “Tom is crazy with a capital c. Never before met a person narcissistic enough to create clones of themselves, yet that’s what you will find beyond the door. His riddle isn’t too much of a challenge, but many second guess themselves or overthink it and miss the obvious details.”"
		},

		{
			"id": 15,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 23,
					"text": "Choose the wooden door. ",
					"given": []
				},
				{
					"id": 12,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "Michael looks at the wooden door. “Barely a challenge at all. Miss Katharina wishes more to provoke your mind than test it. She has quite a neutral view of the world, and often wishes to broaden the views and thoughts of others. I doubt you could fail her trial, even if you tried.”"
		},

		{
			"id": 16,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 17,
					"text": "Start the trial. ",
					"given": []
				}
			],
			"dialogue": "Michael nods and touches the white door. It glows like the previous door did, and he gestures for you to walk through. \n\nYou walk into the room which, indeed, is a kitchen. A young woman, barely an adult, is standing by the counter, mixing various ingredients. \nAs you approach, she looks at you and smiles brightly. “Oh, hello. I’m Violet. Are you here for the trial?” You nod, and she brightens further. \n“Wonderful! You’re just in time! I’m making muffins for my sister. She’s in charge of one of the later trials. Maybe you can bring them to her afterwards!” She claps her hands excitedly, and you grab a spare apron, wondering how this is considered a trial at all."
		},

		{
			"id": 17,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 18,
					"text": "Vanilla dough. ",
					"given": [1]
				},
				{
					"id": 18,
					"text": "Almond dough. ",
					"given": []
				},
				{
					"id": 18,
					"text": "Chocolate dough. ",
					"given": []
				}
			],
			"dialogue": "“Alright!” she squeaks. “Let’s start simple! We need to make the dough. The dough’s almost done already. We just need to flavor it.” She puts three items in front of you; vanilla extract, finely chopped almonds, and finely chopped dark, bittersweet chocolate. \n“My sister and I are like night and day,” she says cheerfully. “And she’s definitely the basic one. I’ll go get the fillings!” With that, she leaves you to figure out the correct flavoring on your own."
		},

		{
			"id": 18,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 19,
					"text": "Strawberry jam filling. ",
					"given": [2]
				},
				{
					"id": 19,
					"text": "Pastry cream filling. ",
					"given": []
				},
				{
					"id": 19,
					"text": "Salty caramel filling.  ",
					"given": []
				}
			],
			"dialogue": "You mix in the flavoring. Violet returns shortly after, deems it fitting, and pours the dough into the muffin forms. You sit in silence for a little moment before Violet drags you back to the counter. \n“We need to get the filling ready. Just put the one you choose into the bag!” She gives you a plastic bag and a spoon, then sets three bowls before you; strawberry jam, pastry cream and salty caramel. \n“She always did have a sweeter tooth than me,” Violet says with a giggle. “I’m surprised she doesn’t match the filling to her fluffy curls!” With that, she once more runs off and searches the kitchen."
		},

		{
			"id": 19,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 20,
					"text": "Top with nuts. ",
					"given": []
				},
				{
					"id": 20,
					"text": "Top with berries. ",
					"given": [3]
				},
				{
					"id": 20,
					"text": "Top with raw sugar. ",
					"given": []
				}
			],
			"dialogue": "You use the spoon to scrape and pour the filling into the plastic bag. When Violet returns with the muffins, she happily accepts the bag, cuts off a corner, and squeezes the filling into the muffins. \n“Okay, before they cool off completely, we need to get the toppings on them!” She gestures to three bowls she’s set out on the table; a bowl full of various kinds of nuts, a bowl full of various kinds of berries, and a bowl full of raw sugar. \n“My sister and I both like to outweigh our previous choices at this stage. Sweetness is good on a salty muffin, and a sharp, tangy flavor tends to fit the basic, sweet muffin my sister likes. Makes it less boring.” She doesn’t run off again, but she doesn’t offer any more words of wisdom either, just looks at you and waits to see what you do."
		},

		{
			"id": 20,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 22,
					"text": "Wait with bated breath. ",
					"given": []
				}
			],
			"dialogue": "Violet inspects the muffins, giving a small hum of thought. “Very good. They look amazing. But do they taste amazing? Do you think you made the perfect muffins for my sister?” She offers you a muffin and takes one for herself."
		},

		{
			"id": 21,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 55,
					"text": "Move on to the next trial. ",
					"given": []
				}
			],
			"dialogue": "You watch nervously, and although she seems to enjoy the muffin, you get a feeling you didn’t make the right muffin. “Sorry,” she suddenly says. “It’s good and you pass the trial, but they won’t earn you any favor if you meet my sister later. You can still have some for the trip though.” She gives you a small basket of muffins. “It can be hungry work, sometimes.” She gestures to a door on the opposite wall from where you entered. “Good luck.”"
		},

		{
			"id": 22,
			"sound": false,
			"image": "",
			"needed": [1, 2, 3],
			"receiving": [-1, -2, -3, 4],
			"redirect": {
				"id": 21,
				"error": ""
			},
			"options": [
				{
					"id": 56,
					"text": "Move on to the next trial. ",
					"given": []
				}
			],
			"dialogue": "Her nose wrinkles, and you’re sure you did something wrong. “Yup,” she says. “That’s her muffin alright.” She puts the muffin down without taking another bite and packs up a couple of them. “If you give these to her, she’s probably going to make her trial easier on you.” She gives you a basket of Lucky Muffins and gestures to a door on the opposite wall from where you entered. “Good luck.”"
		},

		{
			"id": 23,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 24,
					"text": "Start the trial. ",
					"given": []
				}
			],
			"dialogue": "Michael nods and touches the wooden door. It glows like the previous door did, and he gestures for you to walk through. \n \n Upon entry, you notice the room indeed seems to be a library, with a gorgeous mix of modern and old-fashioned furnishing, with a matching door straight across from where you just entered. You stop and listen when you hear a soft, distant hum. \n You follow the hum to a more secluded corner of the large library, and you see a young woman swinging slowly in a hammock. The hammock’s full of blankets, seemingly creating a soft nest for her to rest in, and she is drawing while humming a soft melody. \n You feel like you’ve heard the melody before, and though you cannot place where it’s from, it fills you with relaxation and happiness. \n \n “Welcome to my den.” You’re shocked back to reality, realizing that the hum has stopped while you were lost in your nostalgia. “I’m Katharina, pleased to meet you.” \n You murmur a small greeting, slightly embarrassed by your lack of focus. “I’m sure Michael made my trial sound pointless and easy when he explained it to you, but I would like to warn you right away.” \n She finally looks up from her drawing, catching your gaze immediately. “It may sound easy, but if you aren’t completely stuck in your ways, the thoughts may cling to you for a long time to come.” \n She grins, seeming more like a feral predator than a fellow human. “Let’s get started, shall we?”"
		},

		{
			"id": 24,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 27,
					"text": "The apple and the rock, titled “acceptance”. ",
					"given": []
				},
				{
					"id": 28,
					"text": "The beautiful pearl, titled “perfection”. ",
					"given": []
				},
				{
					"id": 29,
					"text": "The chicken with a duckling, titled “true family”. ",
					"given": []
				},
				{
					"id": 25,
					"text": "How is this even a trial? ",
					"given": []
				}
			],
			"dialogue": "Katharina puts down her drawing tools, making the hammock swing slightly more as she sits up fully. “The other trial makers will test your skills, your wits, your basic intellect and knowledge that may prove useful later in life.” \n You watch as she gets out of the hammock and stretches, flinching as you hear her bones crack and pop. “I, however, do not want to test skills you can easily learn with enough time and dedication. I want to know if you are the right kind of person; willing to listen and learn in the first place.” \n She moves over to a rotating whiteboard, rotating it and revealing three images with titles under them. “So, what would you like to talk about?”"
		},

		{
			"id": 25,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 27,
					"text": "Choose the apple and the rock, titled “acceptance”. ",
					"given": []
				},
				{
					"id": 28,
					"text": "Choose the beautiful pearl, titled “perfection”. ",
					"given": []
				},
				{
					"id": 29,
					"text": "Choose the chicken with a duckling, titled “true family”. ",
					"given": []
				},
				{
					"id": 30,
					"text": "Can we talk about the multi-sided stories instead? ",
					"given": []
				},
				{
					"id": 26,
					"text": "I refuse! This is pointless! ",
					"given": []
				}
			],
			"dialogue": "“We are all different, perfect in our own way. But sometimes we get taught there’s only one side to the story we’re told. This, however, is not true.” She smiles softly at you. “This is why I wish to test for open-mindedness, so I know who I can rely on to help rather than hinder, should I ever need a secondary opinion.” You let your eyes linger on the three images once more."
		},

		{
			"id": 26,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 57,
					"text": "Go to the door and move on to the next trial. ",
					"given": [5]
				}
			],
			"dialogue": "She sighs and gestures back to the area you came from. “I’m sorry you think so. But I will not judge you just because our opinions differ in such a way. The other door will let you through.” \n She gets back into the hammock and resumes her drawing. She seems slightly upset, but you can’t think of anything to say and just turn and leave before you upset her further."
		},

		{
			"id": 27,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 31,
					"text": "Sit with her.",
					"given": [6]
				}
			],
			"dialogue": "You point to the picture of the apple and the rock. “Ah, acceptance. A very good choice, and a very important topic to understand.” She smiles, looking at you with approval. \n \n “Please, sit with me.” She sits down by a small table in a soft looking chair, gesturing for you to sit in the other."
		},

		{
			"id": 28,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 31,
					"text": "Sit with her.",
					"given": [7]
				}
			],
			"dialogue": "You point to the picture of the apple and the rock. “Ah, perfection. A very good choice, and a very important topic to understand.” She smiles, looking at you with approval. \n \n “Please, sit with me.” She sits down by a small table in a soft looking chair, gesturing for you to sit in the other."
		},

		{
			"id": 29,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 31,
					"text": "Sit with her. ",
					"given": [8]
				}
			],
			"dialogue": "You point to the picture of the apple and the rock. “Ah, true family. A very good choice, and a very important topic to understand.” She smiles, looking at you with approval. \n \n “Please, sit with me.” She sits down by a small table in a soft looking chair, gesturing for you to sit in the other."
		},

		{
			"id": 30,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 0,
					"text": "Sit with her. ",
					"given": [9]
				}
			],
			"dialogue": "She seems surprised by the request, but her surprise is quickly replaced by joy. “Oh, it’s been so long since someone chose based on what I say, rather than what I present them with. Please, sit with me.” She sits down by a small table in a soft looking chair, gesturing for you to sit in the other."
		},

		{
			"id": 31,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 32,
					"text": "Grab a drink and a snack and ask her to begin.",
					"given": []
				}
			],
			"dialogue": "Once you sit, she opens a small hatch in the bookcase, which was painted so well that you thought it was another shelf with books. “Help yourself,” she says as she pours herself a cup of tea. \n You move to get a drink from the small room as well, and you’re surprised by the amount of choice you have. Hot chocolate, coffee, tea, fresh juices, water, sodas, cocoa, milk, even a large assortment of fruits, cookies, biscuits and cakes. Clearly she wants you to be comfortable during the chat."
		},

		{
			"id": 32,
			"sound": false,
			"image": "",
			"needed": [6],
			"receiving": [-6],
			"redirect": {
				"id": 33,
				"error": ""
			},
			"options": [
				{
					"id": 0,
					"text": "Go back to the door and move on to the next trial. ",
					"given": [10]
				}
			],
			"dialogue": "“So, acceptance..” She takes a sip of tea and smiles. “Acceptance can be many things, but today we will talk about accepting others. The flaws and quirks, the good and the bad, the prejudice that creates impassable barriers between you and those that could be your best friends.” \n She looks at you, making sure you’re listening. “The picture shows it well. An apple and a rock. The apple is beautiful, and if you’re starving it may even save your life. But you cannot tell from looking at it if it is rotten or has worms. Likewise, the rock may have no uses to you, but once cracked open, it may turn out to be a beautiful geode, full of shimmering crystals. If you knew the apple was full of worms and the rock a geode, would you still pick the apple?” \n She puts down her teacup. “You cannot know what is on the inside. Though some rocks are just rocks, and some apples are delicious, you cannot know this in advance. That is why acceptance is important. It lets us meet strangers and potentially make new friends, friends who will be with us for many years to come.” \n With a smile, she gestures down the path you came from. “Think about it. The door is open for you now.” She gives you a Special Gemstone and goes back to her hammock, once more humming softly to herself."
		},

		{
			"id": 33,
			"sound": false,
			"image": "",
			"needed": [7],
			"receiving": [-7],
			"redirect": {
				"id": 34,
				"error": ""
			},
			"options": [
				{
					"id": 58,
					"text": "Go back to the door and move on to the next trial. ",
					"given": [10]
				}
			],
			"dialogue": "“So, perfection..” She takes a sip of tea and smiles. “If I asked you what perfection was, I’m sure you’d be able to tell me about several things. Special items, good memories, family members, friends, the person you love.. But true perfection does not actually exist.” \n She looks at you, making sure you’re listening. “The things you call perfect may be useless to some other people. True perfection, something that everyone will agree is perfect, is impossible, as someone is always likely to disagree. Even in world-wide competitions for special titles of beauty or perfection, there will always be someone who disagrees.” \n She puts down her teacup. “This is why it’s important to accept that we’re all different, that we will always find different things perfect. Our opinions are part of who we are, and so long as no one tries to force you to share theirs, we should simply accept that we like different things. After all, our flaws are what make us perfect.” \n With a smile, she gestures down the path you came from. “Think about it. The door is open for you now.” She gives you a Special Gemstone and goes back to her hammock, once more humming softly to herself."
		},

		{
			"id": 34,
			"sound": false,
			"image": "",
			"needed": [8],
			"receiving": [-8],
			"redirect": {
				"id": 35,
				"error": ""
			},
			"options": [
				{
					"id": 58,
					"text": "Go back to the door and move on to the next trial. ",
					"given": [10]
				}
			],
			"dialogue": "“So, true family..” She takes a sip of tea and smiles. “Some would say that family is who you grew up with, while some others would say only blood can make you family. Neither of these are true on their own, however.” \n She looks at you, making sure you’re listening. “If you grew up abused, would you love your family as a family, just because of the blood connecting you? And just because you grew up with a family, would you call them your family, even if you did not want to be with them, but had no choice?” \n She puts down her teacup. “Family can be many things, but first of all it is those you love. You may not share blood, you may live far apart, you may barely know each other, but if your heart says you’re family, then clearly you have a connection. A brother is a brother, a sister is a sister, and it does not matter where they came from. Family is in your heart and soul, not just in flesh and blood.” \n With a smile, she gestures down the path you came from. “Think about it. The door is open for you now.” She gives you a Special Gemstone and goes back to her hammock, once more humming softly to herself."
		},

		{
			"id": 35,
			"sound": false,
			"image": "",
			"needed": [9],
			"receiving": [-9],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 58,
					"text": "Go back to the door and move on to the next trial. ",
					"given": [10]
				}
			],
			"dialogue": "“So, multi-sided stories..” She takes a sip of tea and smiles. “It isn’t always a pleasant topic. Many get upset when I bring it up. After all, if we grow up learning that someone was bad, how can someone else possibly claim that they were good?” \n She looks at you, making sure you’re listening. “But we must remember that the winner writes the history books. If two kingdoms are at war because both want the farms to keep their people alive, does it really matter which side you’re on? Both sides want the same, and both sides will attempt to take the other’s lands for their own.” \n She puts down her teacup. “Some people have bad personalities and will act harsher than the opposing force, but that won’t change that their goals may actually be the same. You only think the other side is bad, because you’re not on that side. If you were, then your current side would be the bad one. We really should not judge those that we could have been. After all; we don’t choose where we’re born or raised.” \n With a smile, she gestures down the path you came from. “Think about it. The door is open for you now.” She gives you a Special Gemstone and goes back to her hammock, once more humming softly to herself."
		},

		{
			"id": 36,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 37,
					"text": "Start the trial. ",
					"given": []
				}
			],
			"dialogue": "Michael nods and touches the stone door. It glows like the previous door did, and he gestures for you to walk through. \n \n Inside, you find what looks like a tomb. A very well decorated one, with gold and gemstones in the walls, silk curtains draped along the sides of the room, beautiful golden designs on the stone pillars, the floor made with polished marble, and the furniture made with exotic materials you cannot even name. \n “Welcome.” You look away from the decor, seeing three men laying back in a mountain of pillows. Despite the warning, you rub your eyes and blink rapidly, feeling uncertain whether your eyes are playing a trick on your or not. \n The three men are identical, and they are all dressed in exotic clothes that match the theme of the room."
		},

		{
			"id": 37,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Let’s get started then. ",
					"given": []
				}
			],
			"dialogue": "They all get up as soon as you say you’re here for the trial, and they walk over to a wall with three doors. They sit down on a lavish chair each, placed in front of each of the three doors. \n “One door leads to victory, the other two to your doom, and you may only ask one of us which door leads you true,” says the first. \n “However, not all of us will tell you the truth, for though we look the same, our answers are not. One is Truth who always speaks truth, one is Lie who always lies, and one is Wisdom who may answer either way. You must figure out which of us to ask to get the true path,” says the second. \n “You may ask us all one question each, and from the hints you gain, you must then choose who to ask about the door,” says the third. \n They all grin, and you can’t help feeling like you made a terrible choice. Together, they all call out. “Let the trial begin!”"
		},

		{
			"id": 38,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 39,
					"text": "Ask for a hint. ",
					"given": []
				},
				{
					"id": 47,
					"text": "Ask about the true door. ",
					"given": []
				},
				{
					"id": 52,
					"text": "Choose a door. ",
					"given": ""
				}
			],
			"dialogue": "You look at the three men, contemplating what to do."
		},

		{
			"id": 39,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 40,
					"text": "First man. ",
					"given": []
				},
				{
					"id": 47,
					"text": "Ask about the true door. ",
					"given": []
				},
				{
					"id": 52,
					"text": "",
					"given": []
				}
			],
			"dialogue": "Who do you want to ask?"
		},

		{
			"id": 40,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 45,
					"text": "Who are you? ",
					"given": [11]
				},
				{
					"id": 44,
					"text": "Who is the middle guy? ",
					"given": [11]
				},
				{
					"id": 46,
					"text": "Who is the right guy? ",
					"given": [11]
				}
			],
			"dialogue": "What will you ask first man?"
		},

		{
			"id": 41,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 44,
					"text": "Who are you? ",
					"given": [12]
				},
				{
					"id": 45,
					"text": "Who is the left guy? ",
					"given": [12]
				},
				{
					"id": 45,
					"text": "Who is the right guy? ",
					"given": [12]
				}
			],
			"dialogue": "What will you ask second man?"
		},

		{
			"id": 42,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 44,
					"text": "Who are you? ",
					"given": [13]
				},
				{
					"id": 46,
					"text": "Who is the left guy? ",
					"given": [13]
				},
				{
					"id": 45,
					"text": "Who is the right guy? ",
					"given": [13]
				}
			],
			"dialogue": "What will you ask the third man?"
		},

		{
			"id": 43,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "The man just shakes his head. \n You already asked him for a hint, remember?"
		},

		{
			"id": 44,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“Truth Tom,” he says."
		},

		{
			"id": 45,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“Lie Tom,” he says."
		},

		{
			"id": 46,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“Wisdom Tom,” he says."
		},

		{
			"id": 47,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 48,
					"text": "First man. ",
					"given": [14]
				},
				{
					"id": 49,
					"text": "Second man. ",
					"given": [14]
				},
				{
					"id": 50,
					"text": "Third man. ",
					"given": [14]
				}
			],
			"dialogue": "Who do you want to ask about the door?"
		},

		{
			"id": 48,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“The middle door,” he says."
		},

		{
			"id": 49,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“The right door,” he says."
		},

		{
			"id": 50,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "“The left door,” he says."
		},

		{
			"id": 51,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 38,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You already asked one of them about the true door, so they all refuse to answer."
		},

		{
			"id": 52,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 54,
					"text": "Choose the left door. ",
					"given": []
				},
				{
					"id": 53,
					"text": "Choose the middle door. ",
					"given": []
				},
				{
					"id": 53,
					"text": "Choose the right door. ",
					"given": []
				},
				{
					"id": 38,
					"text": "Go back and ask more. ",
					"given": []
				}
			],
			"dialogue": "You look at the three doors and the three men look at you excitedly. Are you ready to choose?"
		},

		{
			"id": 53,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": -1,
					"text": "Back to menu. ",
					"given": []
				}
			],
			"dialogue": "You walk through the door nervously, and no sooner has the door closed behind you, when the floor begins to move, sending you down a slide into darkness. When you finally land, you notice you’re in a cell of some sort. \n “Ah, a newcomer! Wonderful!” You look towards the voice, the same voice as the three you met before, though this man’s voice is dripping with the promise of pain. “Do not worry, young one, you won’t be inferior for long.” With a sadistic, gleeful laugh, he walks away, leaving you alone in the dark. \n Soon, you too will become just another member of the Tom army. \n \n Game Over. "
		},

		{
			"id": 54,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 59,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You’re stuck in a dark hallway after the door closes, and when nothing bad happens, you start taking slow, careful steps. It takes a few minutes to get to the end, but a door lights up and opens before you, leading you out into another rotunda, similar to the first, but with three new doors. \n “Ah, you made it! I wasn’t sure you would. Tom likes to confuse the poor bastards who choose his trial. Glad to see you made it.” You smile with relief when you hear Michael greet you. You’re safe. For now."
		},

		{
			"id": 55,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 59,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You emerge into another rotunda, similar to the first, but with three new doors. You look around for Michael, when the basket of muffins is torn from your grip. \n “Muffins! Alright!” Immediately, Michael starts gobbling up the muffins from the basket. \n He says some odd greeting through the mouthful of muffin, and you wonder whether he’s starving, or whether his manners are always that horrific."
		},

		{
			"id": 56,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 59,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You emerge into another rotunda, similar to the first, but with three new doors. You look around for Michael, when the basket of muffins is almost torn from your grip. \n “Muffins! Alright!” You just manage to save a single Lucky Muffin before Michael starts gobbling up the other muffins from the basket. \n He says some odd greeting through the mouthful of muffin, and you wonder whether he’s starving, or whether his manners are always that horrific."
		},

		{
			"id": 57,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 59,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You emerge into another rotunda, similar to the first, but with three new doors. You look around for Michael, hoping he won’t notice how guilty you feel. \n However, when you spot him, it’s obvious that he knows. He looks very disappointed in you."
		},

		{
			"id": 58,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 59,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "You emerge into another rotunda, similar to the first, but with three new doors. You look around for Michael, when your wrist is grabbed from behind. \n “Ooooh! Pretty!” You turn and look, seeing Michael holding on to your wrist and staring at the Special Gemstone. “You actually sat through her philosophy blabbering? Impressive. People rarely have the patience for her long speeches.” You try to tell him that the chat wasn’t that long, but he doesn’t seem to be listening. \n He’s far too busy staring at the sparkling gem in your hand."
		},

		{
			"id": 59,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 60,
					"text": "Look at the doors. ",
					"given": []
				}
			],
			"dialogue": "“The second set of trials is more intense.” You look at Michael, as he moves to the middle of the room. “Only one of them is fully safe, and the other two are not only potentially lethal, but you may fail them and have to return here.” You just nod and look at the three new doors."
		},

		{
			"id": 60,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 61,
					"text": "Ask about the laboratory door. ",
					"given": []
				},
				{
					"id": 62,
					"text": "Ask about the normal door. ",
					"given": []
				},
				{
					"id": 63,
					"text": "Ask about the hospital door. ",
					"given": []
				}
			],
			"dialogue": "You look at the three doors. \n Both the left and the right door are pristine white, however the markings are very different. The left door seems laboratory-like, whilst the right one seems medical, hospital-like. The door in the middle is also white, but seems to be a normal wooden door, common in most households."
		},

		{
			"id": 61,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 66,
					"text": "Choose the laboratory door. ",
					"given": []
				},
				{
					"id": 60,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "Michael grins. “Ah, Aimee. The resident mad scientist. She’s crazy, but harmless. Most of the time. She’s probably got some technological tinkering she could use some help with.” He chuckles, seeming to get lost in thoughts and memories."
		},

		{
			"id": 62,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 77,
					"text": "Choose the normal door. ",
					"given": []
				},
				{
					"id": 60,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "With a sigh, Michael rubs his temples. “Matthew volunteered to make a trial, but kept delaying it because he was too busy obsessing over his precious chocolate milk, so we had to turn that into a trial. All I can say if you choose his trial is good luck.”"
		},

		{
			"id": 63,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 107,
					"text": "Choose the hospital door. ",
					"given": []
				},
				{
					"id": 60,
					"text": "Look at the doors again. ",
					"given": []
				}
			],
			"dialogue": "“Lukas’ trial..” Michael doesn’t look all that keen, and seems to avoid the door. “He’s a good guy, but his reasoning can be confusing. He once wanted to make a plague that would turn the victim’s lifeforce into an ethereal energy, which he wanted to use to get a friend back from the dead. Took months to convince him it would be a bad idea!”"
		},

		{
			"id": 64,
			"sound": false,
			"image": "",
			"needed": [],
			"receiving": [],
			"redirect": {
				"id": null,
				"error": null
			},
			"options": [
				{
					"id": 60,
					"text": "Continue. ",
					"given": []
				}
			],
			"dialogue": "The door does not budge. “You failed that trial. You have to choose another one.” You listen to Michael and choose another door."
		}
	]
}